#В данном блоке мы создаем стартовое окно с правилами для пользователя
#В данном блоке пользователь выбирает уровень для последующей игры
def start():
    # #интерфейс для разработчика
    # print("  IN START  ")
    # print("            ")
    
    print("Привет!")
    print("       ")
    print("Вы попали в лабиринт и вам необходимо из него выйти")
    print("На вашем пути могут быть монстры, пустые комнаты, комнаты со снаряжением, комнаты для зачарования оружия и доспехов")
    print("Чтобы выйти, вы должны найти все ключи для открытия портала")
    print("Вы можете выбрать свой уровень сложности от 1 до 3")
    print("1 - простой уровень, много снаряжения, мало боссов. Для выхода нужен 1 ключ")
    # print("2 - средний уровень, немного снаряжения, не особо много боссов. Для выхода нужно 2 ключа")
    # print("3 - сложный уровень, мало снаряжения, много боссов. Для выхода нужно 3 ключа")
    print("В ИГРЕ ПОКА ЧТО ТОЛЬКО ОДИН УРОВЕНЬ")    
    
    while (True):
        print("Введите свой уровень:")
        print("         ")
        str_input = str(input())
        if str_input == "1":
            print("Вы выбрали 1 уровень")
            return 1

        # elif str_input == "2":
        #     print("Вы выбрали 2 уровень")
        #     return 2

        # elif str_input == "3":
        #     print("Вы выбрали 3 уровень")
        #     return 3
        else:
            print("Кажется, вы ввели что-то не то. Попробуйте снова")
